{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.18.0",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "float_input",
          "Re_ReduceSumSquarecst"
        ],
        "output": [
          "Re_reduced0"
        ],
        "name": "Re_ReduceSumSquare",
        "opType": "ReduceSumSquare",
        "attribute": [
          {
            "name": "keepdims",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "Re_reduced0",
          "Mu_Mulcst"
        ],
        "output": [
          "Mu_C0"
        ],
        "name": "Mu_Mul",
        "opType": "Mul",
        "domain": ""
      },
      {
        "input": [
          "float_input",
          "Ge_Gemmcst",
          "Mu_C0"
        ],
        "output": [
          "Ge_Y0"
        ],
        "name": "Ge_Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": -2.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "Re_reduced0",
          "Ge_Y0"
        ],
        "output": [
          "Ad_C01"
        ],
        "name": "Ad_Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "Ad_Addcst",
          "Ad_C01"
        ],
        "output": [
          "Ad_C0"
        ],
        "name": "Ad_Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "Ad_C0"
        ],
        "output": [
          "label"
        ],
        "name": "Ar_ArgMin",
        "opType": "ArgMin",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "keepdims",
            "i": "0",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "Ad_C0"
        ],
        "output": [
          "scores"
        ],
        "name": "Sq_Sqrt",
        "opType": "Sqrt",
        "domain": ""
      }
    ],
    "name": "c554d481dc914d719b27d772e34de2ea",
    "initializer": [
      {
        "dims": [
          "5"
        ],
        "dataType": 1,
        "floatData": [
          202.50883,
          107.21737,
          94.9159,
          126.18674,
          117.28926
        ],
        "name": "Ad_Addcst"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "1"
        ],
        "name": "Re_ReduceSumSquarecst"
      },
      {
        "dims": [
          "5",
          "3"
        ],
        "dataType": 1,
        "floatData": [
          3.9755416,
          -9.76483,
          9.557824,
          -2.466838,
          9.029932,
          4.4263315,
          1.7919585,
          -6.757233,
          -6.785616,
          -8.471819,
          7.121138,
          1.9246843,
          6.846698,
          -5.7058883,
          -6.1526284
        ],
        "name": "Ge_Gemmcst"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 1,
        "floatData": [
          0.0
        ],
        "name": "Mu_Mulcst"
      }
    ],
    "input": [
      {
        "name": "float_input",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {},
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "label",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {}
              ]
            }
          }
        }
      },
      {
        "name": "scores",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {},
                {
                  "dimValue": "5"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "",
      "version": "18"
    }
  ],
  "metadataProps": [
    {
      "key": "sklearn_model",
      "value": "KMeans"
    }
  ]
}